Examinator/src/Catalogs/УчебныеГруппыОО/УчебныеГруппыОО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеГруппыОО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.СпециальностиОО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодПоступления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.ОтделенияОО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбученияОО</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/СтудентыОО/СтудентыОО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтудентыОО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.КурсыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыСтудентовОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.СпециализацииОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.СпециальностиОО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбученияОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.ОтделенияОО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/УчебныеГруппыОО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция Участники(УчебнаяГруппа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.Пользователь,
		|	СтудентыООСрезПоследних.Пользователь.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних(, ) КАК СтудентыООСрезПоследних
		|ГДЕ
		|	СтудентыООСрезПоследних.УчебнаяГруппа = &УчебнаяГруппа";

	Запрос.УстановитьПараметр("УчебнаяГруппа", УчебнаяГруппа);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция УчебнаяГруппаПользователя(Знач Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.УчебнаяГруппа,
		|	СтудентыООСрезПоследних.УчебнаяГруппа.Наименование КАК НаименованиеУчебнойГруппы
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних(, ) КАК СтудентыООСрезПоследних
		|ГДЕ
		|	СтудентыООСрезПоследних.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УчебнаяГруппа) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат Новый Структура("УчебнаяГруппа, Наименование", ВыборкаДетальныеЗаписи.УчебнаяГруппа, ВыборкаДетальныеЗаписи.НаименованиеУчебнойГруппы);
		
	КонецЕсли;
	
КонецФункции


// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(УчебнаяГруппа, ДополнительныеДанные=Неопределено) Экспорт

	
		УстановитьПривилегированныйРежим(Истина);
	
		Справочники.УчебныеГруппыСУО.ОбновитьДанныеВебКабинета(УчебнаяГруппа, ДополнительныеДанные);

	
КонецПроцедуры

#КонецЕсли
